pisoBodyFoam_FF1/LeftDomain/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoBodyFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         30;

deltaT          0.01;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.25;
maxAlphaCo      0.25;
maxDeltaT       1;

functions
{

    Centreline
    {
        libs ( "libsampling.so" );
        type        probes;

        writeControl   timeStep;
        writeInterval  1;
        setFormat raw;
        interpolationScheme cellPointFace;
        fields 
        (
            U
            p
        );

	probeLocations
	(
                (-1.5	0.0	-0.35)
                (-1.0	0.0	-0.35)
                (-0.5	0.0	-0.35)
                //(-0.4	0.0	-0.35) This is where the boundary will be so omit
                (-0.3	0.0	-0.35)
                (-0.2	0.0	-0.35)
                (-0.1	0.0	-0.35)
                (0.0	0.0	-0.35)
		(0.1	0.0	-0.35)
		(0.2	0.0	-0.35)
		(0.3	0.0	-0.35)
		(0.4	0.0	-0.35)
		(0.5	0.0	-0.35)
		(0.6	0.0	-0.35)
		(0.7	0.0	-0.35)
		(0.8	0.0	-0.35)
		(0.9	0.0	-0.35)
		(1.0	0.0	-0.35)
		(1.1	0.0	-0.35)
		(1.2	0.0	-0.35)
		(1.3	0.0	-0.35)
		(1.4	0.0	-0.35)
		(1.5	0.0	-0.35)
		(1.6	0.0	-0.35)
		(1.7	0.0	-0.35)
		(1.8	0.0	-0.35)
		(1.9	0.0	-0.35)
		(2.0	0.0	-0.35)
                (2.5	0.0	-0.35)
                (3.0	0.0	-0.35)
                (3.5	0.0	-0.35)
                (4.0	0.0	-0.35)
	);
    }

    Offset010
    {
        libs ( "libsampling.so" );
        type        probes;

        writeControl   timeStep;
        writeInterval  1;
        setFormat raw;
        interpolationScheme cellPointFace;
        fields 
        (
            U
            p
        );

	probeLocations
	(
                (-1.5	0.1	-0.35)
                (-1.0	0.1	-0.35)
                (-0.5	0.1	-0.35)
                //(-0.4	0.1	-0.35) This is where the boundary will be so omit
                (-0.3	0.1	-0.35)
                (-0.2	0.1	-0.35)
                (-0.1	0.1	-0.35)
                (0.0	0.1	-0.35)
		(0.1	0.1	-0.35)
		(0.2	0.1	-0.35)
		(0.3	0.1	-0.35)
		(0.4	0.1	-0.35)
		(0.5	0.1	-0.35)
		(0.6	0.1	-0.35)
		(0.7	0.1	-0.35)
		(0.8	0.1	-0.35)
		(0.9	0.1	-0.35)
		(1.0	0.1	-0.35)
		(1.1	0.1	-0.35)
		(1.2	0.1	-0.35)
		(1.3	0.1	-0.35)
		(1.4	0.1	-0.35)
		(1.5	0.1	-0.35)
		(1.6	0.1	-0.35)
		(1.7	0.1	-0.35)
		(1.8	0.1	-0.35)
		(1.9	0.1	-0.35)
		(2.0	0.1	-0.35)
                (2.5	0.1	-0.35)
                (3.0	0.1	-0.35)
                (3.5	0.1	-0.35)
                (4.0	0.1	-0.35)
	);
    }

    Offset030
    {
        libs ( "libsampling.so" );
        type        probes;

        writeControl   timeStep;
        writeInterval  1;
        setFormat raw;
        interpolationScheme cellPointFace;
        fields 
        (
            U
            p
        );

	probeLocations
	(
                (-1.5	0.3	-0.35)
                (-1.0	0.3	-0.35)
                (-0.5	0.3	-0.35)
                //(-0.4	0.3	-0.35) This is where the boundary will be so omit
                (-0.3	0.3	-0.35)
                (-0.2	0.3	-0.35)
                (-0.1	0.3	-0.35)
                (0.0	0.3	-0.35)
		(0.1	0.3	-0.35)
		(0.2	0.3	-0.35)
		(0.3	0.3	-0.35)
		(0.4	0.3	-0.35)
		(0.5	0.3	-0.35)
		(0.6	0.3	-0.35)
		(0.7	0.3	-0.35)
		(0.8	0.3	-0.35)
		(0.9	0.3	-0.35)
		(1.0	0.3	-0.35)
		(1.1	0.3	-0.35)
		(1.2	0.3	-0.35)
		(1.3	0.3	-0.35)
		(1.4	0.3	-0.35)
		(1.5	0.3	-0.35)
		(1.6	0.3	-0.35)
		(1.7	0.3	-0.35)
		(1.8	0.3	-0.35)
		(1.9	0.3	-0.35)
		(2.0	0.3	-0.35)
                (2.5	0.3	-0.35)
                (3.0	0.3	-0.35)
                (3.5	0.3	-0.35)
                (4.0	0.3	-0.35)
	);
    }

}

libs
(
);

// ************************************************************************* //
