pisoBodyFoam_FF1/LeftDomain/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

#runApplication decomposePar
runParallel pisoBodyFoam

# ----------------------------------------------------------------- end-of-file
